# DividedPathDistanceTooSmall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures..::..DividedPathDistanceTooSmall Property
BuiltInFailures..::..DividedPathFailures Class See Also
---
Distance is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedPathDistanceTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedPathDistanceTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedPathDistanceTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedPathFailures Class
Autodesk.Revit.DB Namespace